Revit 2026 API

# GridNode Properties

---

The GridNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UIndex | The node's index along the U axis. |
|  | VIndex | The node's index along the V axis. |

#### Reference

GridNode Structure

Autodesk.Revit.DB Namespace